import type { Dictionary } from "@/types";

export const ru: Dictionary = {
  PERSONAL_DATA: {
    fullName: "Риан Пратама",
    summary:
      "Software Engineer, специализирующийся на фронтенд-разработке. Обладаю навыками разработки высококачественных решений, адаптированных к требованиям клиентов, и стремится быть в курсе тенденций отрасли и новейших технологий.",
    softwareEngineer: "Software Engineer",
    contactMe: "Свяжиться",
    learnMore: "Узнать больше",
    age: "г.",
    about:
      "На третьем курсе университета я присоединился к бесплатному курсу программирования, который вел мой индонезийский друг в своей квартире в Казани, Россия. Вместе с другими студентами я изучил основы JavaScript, и мы в конечном итоге основали стартап-разработчика программного обеспечения под названием faoTech в 2022 году. Развивая свои навыки, я обнаружил в себе страсть к frontend-разработке и решил специализироваться в этой области.",
  },

  NAVBAR_DATA: {
    about: "Обо мне",
    projects: "Проекты",
    contacts: "Контакты",
  },

  SECTIONS: {
    backToHomepage: "На главную страницу",
    present: "настоящее время",
    resume: "Резюме",
    aboutMe: "Обо мне",
    featuredProjects: "Выделенные проекты",
    moreContacts: "Ещё контакты",
    moreContactsDescription:
      "В данный момент я активно ищу новые возможности и буду рад услышать о любых потенциальных возможностях, которые могут быть доступны. Пожалуйста, не стесняйтесь обращаться ко мне, если у вас есть какие-либо идеи или вы хотите обсудить потенциальное сотрудничество.",
    dicussYourProject: "Обсудим ваш проект?",
    professionalExperience: "Опыт работы",
    visitProject: "Посетить проект",
  },

  LOCATIONS: {
    jakarta: "Джакарта, Индонезия",
    remote: "Удалённо",
    tokyo: "Токио, Япония",
  },

  DISCUSS_YOUR_PROJECT: {
    formSent: "Заявка успешно отправлена",
    thankYou:
      "Спасибо за обращение по проекту. Я благодарю вас за сообщение и свяжусь с вами как можно скорее, чтобы обсудить дальнейшие детали.",
    gotIt: "Понял, спасибо!",

    submit: "Отправить",
    name: {
      error: "Введите Ваше имя",
      label: "Имя",
      placeholder: "Дима",
    },
    email: {
      error: "Предоставьте действительный адрес электронной почты",
      label: "Электронная почта",
      placeholder: "dima@gmail.com",
    },
    projectDescription: {
      error: "Предоставьте более подробное описание проекта",
      label: "О проекте",
      placeholder: "Привет, хотел бы обсудить про новый проект...",
    },
  },
};
