import type { Dictionary } from "@/types";

export const ru: Dictionary = {
  PERSONAL_DATA: {
    fullName: "Риан Пратама",
    summary:
      "Software Engineer с более чем 2-летним опытом разработки веб- и мобильных приложений с использованием Next.js и React Native. Обладает навыками разработки высококачественных решений, адаптированных к требованиям клиентов, и стремится быть в курсе тенденций отрасли и новейших технологий.",
    softwareEngineer: "Software Engineer",
    contactMe: "Свяжиться",
    learnMore: "Узнать больше",
    age: "23 г.",
    about:
      "В сентябре 2022 года я присоединился к бесплатному курсу программирования, который вел мой индонезийский друг в его квартире в Казани, Россия. Вместе с другими студентами мы изучили основы JavaScript и в конечном итоге в январе 2023 года сформировали стартап по производству программного обеспечения под названием «faoTech». По мере того, как я развивал свои навыки, я обнаружил в себе страсть к full-stack разработке и решил специализироваться в этой области.",
  },

  NAVBAR_DATA: {
    about: "About",
    projects: "Projects",
    contacts: "Contacts",
  },

  SECTIONS: {
    backToHomepage: "На главную страницу",
    present: "настоящее время",
    resume: "Резюме",
    aboutMe: "Обо мне",
    featuredProjects: "Выделенные проекты",
    moreContacts: "Ещё контакты",
    moreContactsDescription:
      "В данный момент я активно ищу новые возможности и буду рад услышать о любых потенциальных возможностях, которые могут быть доступны. Пожалуйста, не стесняйтесь обращаться ко мне, если у вас есть какие-либо идеи или вы хотите обсудить потенциальное сотрудничество.",
    dicussYourProject: "Обсудим ваш проект?",
    professionalExperience: "Опыт работы",
    visitProject: "Посетить проект",
  },

  LOCATIONS: {
    jakarta: "Джакарта, Индонезия",
    remote: "Удалённо",
  },

  DISCUSS_YOUR_PROJECT: {
    formSent: "Заявка успешно отправлена",
    thankYou:
      "Спасибо за обращение по проекту. Я благодарю вас за сообщение и свяжусь с вами как можно скорее, чтобы обсудить дальнейшие детали.",
    gotIt: "Понял, спасибо!",

    submit: "Отправить",
    name: {
      error: "Введите Ваше имя",
      label: "Имя",
      placeholder: "Дима",
    },
    email: {
      error: "Предоставьте действительный адрес электронной почты",
      label: "Электронная почта",
      placeholder: "dima@gmail.com",
    },
    projectDescription: {
      error: "Предоставьте более подробное описание проекта",
      label: "О проекте",
      placeholder: "Привет, хотел бы обсудить про новый проект...",
    },
  },
};
