import type { Dictionary } from "@/types";

export const ja: Dictionary = {
  s: {
    CERTIFICATIONS: {
      "jlpt-n3": "日本語能力試験N3",
      "preparatory-faculty-of-russian-language": "ロシア語予備学部",
    },

    PERSONAL_DATA: {
      languages: {
        en: "英語",
        id: "インドネシア語",
        ru: "ロシア語",
        ja: "日本語",
      },
      fullName: "ライアン・プラタマ",
      summary:
        "フロントエンド開発を専門とする経験豊富なソフトウェアエンジニア。業界のトレンドや最新テクノロジーを常に最新の状態に保ち、クライアントの要件に合わせた高品質のソリューションを作成することに熟練しています。",
      summaryShort:
        "経験豊富なソフトウェアエンジニアで、フロントエンド開発を専門としています。ニーズに合ったソリューションを提供することに尽力し、最新の技術トレンドに常に追随しています。",
      softwareEngineer: "ソフトウェアエンジニア",

      about:
        "大学の3学期目に、ロシアのカザンにあるインドネシア人の友人のアパートで行われた無料のプログラミングコースに参加しました。他の学生たちと一緒にJavaScriptの基本を学び、最終的に2022年にfaoTechというソフトウェアハウスのスタートアップを設立しました。スキルを磨くうちに、フロントエンド開発に情熱を感じ、この分野に特化することを決めました。",
    },

    COUNTER: {
      age: "歳",
      yearsExperience: "年の経験",
    },

    MENUS: {
      certifications: "認定資格",
      more: "すべて表示",
      additionalInformation: "追加情報",
      experience: "職歴",
      about: "私について",
      featuredProjects: "注目のプロジェクト",
      contacts: "連絡先",
      message: "繋がりましょう！",
      blog: "ブログ",
      main: "ホームページ",
    },

    TECH_STACKS: {
      programmingLanguages: "開発言語",
      librariesFrameworks: "フレームワーク",
      db: "データベース",
      learning: "自己学習",
    },

    OTHER: {
      education: "学歴",
      languages: "言語",
    },

    CONSTANTS: {
      PROJECTS: {
        rymal:
          "ドバイ発の高級香水ブランド。モダンなECプラットフォーム、プロモーション機能、ダイナミックなランディングページ、メール配信システム、そして香水コレクションを美しく紹介するショーケースを備えています。",
        faotour:
          "ヨーロッパとアジアを横断する多様なツアーを提供する旅行代理店で、ツアーパッケージ、プロモーション、コンテンツを管理するためのSanity CMS、動的ランディングページ、メールシステム、ツアー紹介ページを備え、サービスの強調を行います。",
        pemudaicmi:
          "ニュース、ジャーナル、コンテンツを管理するSanity CMS、動的ランディングページ、メールシステム、そしてイベントの紹介機能を備えた、若いムスリム知識人の組織です。コミュニケーションを効率化し、活動を強調するためのものです。",
        hebronstar:
          "韓国のコンサルティング会社で、グローバルサービスと産業を提供しており、求人広告や応募者管理のためのキャリアマイクロサイト、管理者ダッシュボード、およびランディングページを特徴としています。",
        turuntangan:
          "インドネシア最大の非営利青年ボランティアネットワークで、100以上のチャプターを有し、ボランティアの管理、サイトコンテンツの表示と管理、ボランティアネットワークと運営の自動化を行うための管理者ダッシュボードが含まれています。",
        belinsky:
          "プロフェッショナルな写真撮影と映像制作を専門とするプロダクションハウス兼クリエイティブスタジオで、サービス内容、クリエイティブ作品、クライアントプロジェクトを紹介し、新規顧客を引き付けています。",
        mandiri: "肥料および化学業界の顧客に向けて、会社情報や製品情報を提供する、総合商社および化学品取引を専門とする貿易会社。",
        kima: "大学が特定分野におけるプログラムの関連性や、職業市場の能力要件との整合性を評価するのを支援するデジタルプラットフォーム。",
      },

      HISTORY: {
        kfu: {
          label: "カザン連邦大学",
          desc: "学士号、経営学",
          duty: null,
        },
        nutech: {
          about:
            "TelkomGroupの一員として、東南アジアでインドネシアをデジタルイノベーションのリーディングハブにすることに努め、顧客体験に基づき最高の品質を効率的に提供しています。",
          label: "PT Nutech Integrasi",
          desc: "フロントエンドエンジニア",
          duty: [
            "インドネシア関税総局向けのウェブアプリCEISA 4.0を開発し、5000人以上のユーザーに影響を与えました。",
            "25以上の書類形式を作成し、React-pdf、jsPDF、ExcelJSを使用してPDF/XLSXレンダリングを実装しました。",
            "単体テスト、統合テスト、エンドツーエンドテストなどの包括的なテストでアプリの品質を確保しました。",
            "Axiosを使用してAPIのシームレスな統合を実装しました。",

            "主にAnt Designを使用して完全にレスポンシブなユーザーインターフェースを構築しました。",
            "UI/UXデザイナーと協力して、視覚的に魅力的で直感的なインターフェースを実装しました。",

            "バックエンドエンジニアやQAエンジニアを含むクロスファンクショナルチームと協力しました。",
            "システムアナリストと定期的かつ効果的なコミュニケーションを維持しました。",
            "GitとJiraを利用して、機能強化とバグ修正の優先順位をつけました。",
            "文書を作成し、ステークホルダーの理解を助け、将来のメンテナンスを支援しました。",
          ],
        },

        rave: {
          about: "",
          label: "Rave Tech Pte. Ltd.",
          desc: "フロントエンドエンジニア",
          duty: [
            "サニティCMSを活用して、旅行代理店ウェブサイトのコンテンツ管理を効率化。クライアントが目的地情報、旅行パッケージ、プロモーション内容を簡単に更新できるようにしました。",
            "UI/UXデザイナーと協力し、視覚的に魅力的なユーザーインターフェイスを作成しました。",
            "再利用可能なReactコンポーネントを開発し、コードの一貫性と拡張性を維持しました。",
            "WCAG基準に準拠するためのアクセシビリティのベストプラクティスの実装を支援しました。",
            "LighthouseやChrome DevToolsなどのツールを使用して、パフォーマンスのボトルネックを監視し解決しました。",
            "Tailwind CSSを導入し、スタイリングプロセスを効率化し、開発時間を大幅に短縮しました。",
          ],
        },

        waterhub: {
          label: "WaterHub",
          desc: "フリーランスのフロントエンドエンジニア",
          duty: ["TBA"],
          about: "",
        },

        freelance: {
          label: "RYPR Studio",
          desc: "フリーランスのフルスタックエンジニア",
          duty: [
            "デバイス間で互換性のある2つのレスポンシブWebアプリを構築し、スムーズなローディングアニメーションを統合。",
            "Sanity CMSを活用し、クライアントがコンテンツを簡単に更新・管理できるように効率的なコンテンツ管理を実現。",
            "フリーランスのUI/UXデザイナーと協力し、視覚的に魅力的なユーザーインターフェースを作成。",
            "i18nextフレームワークを使用して、国際化サポートを統合。",
            "tRPCを使用してバックエンド開発を主導し、高速で安全、かつ効率的なサーバーサイドロジックを実現。",
            "クライアントとの明確なコミュニケーションを促進するために、包括的なドキュメンテーションを維持。",
            "アプリケーションの継続的なメンテナンスとサポートを提供。",
          ],
          about:
            "本業の時間外で、私は世界中のプロジェクトにオープンで、動的で高品質なウェブアプリケーションに重点を置いたフルスタック開発の専門知識を提供しています。",
        },

        faotech: {
          about:
            "インドネシアに本拠を置くソフトウェアハウスの会社です。インドネシアとロシアの教育背景を組み合わせることで、さまざまな業界や地域のお客様にサービスを提供しています。",
          label: "faoTech",
          desc: "フルスタックエンジニア",
          duty: [
            "3つのプロジェクトで2〜3人のエンジニアからなるフロントエンドチームを管理しました。",
            "デバイスに対応したレスポンシブなウェブアプリを構築し、ローディングアニメーションを統合しました。",
            "ログイン、登録、アカウント回復などの基本的な認証機能を実装しました。",
            "UI/UXデザイナーと協力して、視覚的に魅力的なユーザーインターフェースを作成しました。",
            "i18nextフレームワークを使用して国際化サポートを統合しました。",

            "API開発、サーバーサイドロジック、データベース管理を含むバックエンド開発を主導しました。",
            "CRUD操作に精通しており、APIエンドポイントを最適化しました。",

            "ステークホルダーとの理解を促進するために、包括的なドキュメントを維持しました。",
            "アプリケーションの継続的な保守とサポートを提供しました。",
          ],
        },
      },
    },

    SECTIONS: {
      share: "この記事を楽しんでいただけましたか？この投稿を共有して、他の人をインスパイアしましょう！",
      notFound: "ページが見つかりません",
      backToHomepage: "ホームページに戻る",
      present: "現在",
      resume: "職務経歴書",
      visitProject: "プロジェクト訪問",
    },

    LOCATIONS: {
      singapore: "シンガポール",
      jakarta: "ジャカルタ",
      tokyo: "東京",
      kazan: "カザン",
      bali: "バリ島",
    },

    LOCATION_TYPES: {
      onsite: "オフィス勤務",
      remote: "リモート",
    },
    MESSAGE: {
      sent: "メッセージは正常に送信されました",
      thankYou:
        "プロジェクトに関するお問い合わせありがとうございます。メッセージをありがとうございます。できるだけ早く詳細をお話しするためにお返事いたします。",

      send: "提出する",
      name: {
        error: "名前を入力してください",
        placeholder: "名前",
      },
      email: {
        error: "有効なメールアドレスを入力してください",
        placeholder: "メール",
      },
      message: {
        error: "より詳細なメッセージを提供してください",
        placeholder: "メッセージ",
      },
    },
  },

  d: {
    updatedOn: (date: string) => `${date}に更新`,
  },
};
